martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    err = nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &nvs);
    if (err != ESP_OK) {
        return err;
    }

    err = nvs_set_str(nvs, "ssid", set_sta_arg.ssid->sval[0]);
    if (err == ESP_OK) {
        err = nvs_set_str(nvs, "passwd", set_sta_arg.password->sval[0]);
        if (err == ESP_OK) {
            if (set_sta_arg.ent_username->count > 0) {
                err = nvs_set_str(nvs, "ent_username", set_sta_arg.ent_username->sval[0]);
            }
            else {
                err = nvs_set_str(nvs, "ent_username", "");
            }

            if (err == ESP_OK) {
                if (set_sta_arg.ent_identity->count > 0) {
                    err = nvs_set_str(nvs, "ent_identity", set_sta_arg.ent_identity->sval[0]);
                }
                else {
                    err = nvs_set_str(nvs, "ent_identity", "");
                }

                if (err == ESP_OK) {
                    // Save WPA2-Enterprise settings
                    if (set_sta_arg.eap_method->count > 0) {
                        nvs_set_i32(nvs, "eap_method", set_sta_arg.eap_method->ival[0]);
                        eap_method = set_sta_arg.eap_method->ival[0];
                    }
                    if (set_sta_arg.ttls_phase2->count > 0) {
                        nvs_set_i32(nvs, "ttls_phase2", set_sta_arg.ttls_phase2->ival[0]);
                        ttls_phase2 = set_sta_arg.ttls_phase2->ival[0];
                    }
                    if (set_sta_arg.cert_bundle->count > 0) {
                        nvs_set_i32(nvs, "cert_bundle", set_sta_arg.cert_bundle->ival[0]);
                        use_cert_bundle = set_sta_arg.cert_bundle->ival[0];
                    }
                    if (set_sta_arg.no_time_check->count > 0) {
                        nvs_set_i32(nvs, "no_time_chk", set_sta_arg.no_time_check->ival[0]);
                        disable_time_check = set_sta_arg.no_time_check->ival[0];
                    }

                    err = nvs_commit(nvs);
                    if (err == ESP_OK) {
                        ESP_LOGI(TAG, "STA settings stored (ssid=%s).", set_sta_arg.ssid->sval[0]);
                    }
                }
            }
        }
    }
    nvs_close(nvs);
    return err;
}

static void register_set_sta(void)
{
    set_sta_arg.ssid = arg_str1(NULL, NULL, "<ssid>", "SSID");
    set_sta_arg.password = arg_str1(NULL, NULL, "<passwd>", "Password");
    set_sta_arg.ent_username = arg_str0("-u", "--username", "<ent_username>", "Enterprise username");
    set_sta_arg.ent_identity = arg_str0("-a", "--identity", "<ent_identity>", "Enterprise identity");
    set_sta_arg.eap_method = arg_int0("-e", "--eap", "<0-3>", "EAP method (0=Auto,1=PEAP,2=TTLS,3=TLS)");
    set_sta_arg.ttls_phase2 = arg_int0("-p", "--phase2", "<0-3>", "TTLS phase2 (0=MSCHAPv2,1=MSCHAP,2=PAP,3=CHAP)");
    set_sta_arg.cert_bundle = arg_int0("-c", "--cert-bundle", "<0|1>", "Use CA cert bundle");
    set_sta_arg.no_time_check = arg_int0("-t", "--no-time-check", "<0|1>", "Skip cert time check");
    set_sta_arg.end = arg_end(6);

    const esp_console_cmd_t cmd = {
        .command = "set_sta",
        .help = "Set SSID and password of the STA interface",
        .hint = NULL,
        .func = &set_sta,
        .argtable = &set_sta_arg
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
#endif


/** Arguments used by 'set_sta_static' function */
static struct {
    struct arg_str *static_ip;
    struct arg_str *subnet_mask;
    struct arg_str *gateway_addr;
    struct arg_end *end;
} set_sta_static_arg;

/* 'set_sta_static' command */
int set_sta_static(int argc, char **argv)
{
    esp_err_t err;
    nvs_handle_t nvs;

    /* "set_sta_static dhcp" clears static IP and reverts to DHCP */
    if (argc == 2 && strcmp(argv[1], "dhcp") == 0) {
        err = nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &nvs);
        if (err != ESP_OK) {
            return err;
        }
        nvs_erase_key(nvs, "static_ip");
        nvs_erase_key(nvs, "subnet_mask");
        nvs_erase_key(nvs, "gateway_addr");
        err = nvs_commit(nvs);
        nvs_close(nvs);
        if (err == ESP_OK) {
            ESP_LOGI(TAG, "Static IP cleared. Will use DHCP after reboot.");
        }
        return err;
    }

    int nerrors = arg_parse(argc, argv, (void **) &set_sta_static_arg);
    if (nerrors != 0) {
        arg_print_errors(stderr, set_sta_static_arg.end, argv[0]);
        return 1;
    }

    preprocess_string((char*)set_sta_static_arg.static_ip->sval[0]);
    preprocess_string((char*)set_sta_static_arg.subnet_mask->sval[0]);
    preprocess_string((char*)set_sta_static_arg.gateway_addr->sval[0]);

    err = nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &nvs);
    if (err != ESP_OK) {
        return err;
    }

    err = nvs_set_str(nvs, "static_ip", set_sta_static_arg.static_ip->sval[0]);
    if (err == ESP_OK) {
        err = nvs_set_str(nvs, "subnet_mask", set_sta_static_arg.subnet_mask->sval[0]);
        if (err == ESP_OK) {
            err = nvs_set_str(nvs, "gateway_addr", set_sta_static_arg.gateway_addr->sval[0]);
            if (err == ESP_OK) {
              err = nvs_commit(nvs);
                if (err == ESP_OK) {
                    ESP_LOGI(TAG, "STA Static IP settings %s/%s/%s stored.", set_sta_static_arg.static_ip->sval[0], set_sta_static_arg.subnet_mask->sval[0], set_sta_static_arg.gateway_addr->sval[0]);
                }
            }
        }
    }
    nvs_close(nvs);
    return err;
}

static void register_set_sta_static(void)
{
    set_sta_static_arg.static_ip = arg_str1(NULL, NULL, "<ip>", "IP");
    set_sta_static_arg.subnet_mask = arg_str1(NULL, NULL, "<subnet>", "Subnet Mask");
    set_sta_static_arg.gateway_addr = arg_str1(NULL, NULL, "<gw>", "Gateway Address");
    set_sta_static_arg.end = arg_end(3);

    const esp_console_cmd_t cmd = {
        .command = "set_sta_static",
        .help = "Set Static IP for the STA interface, or 'set_sta_static dhcp' to use DHCP",
        .hint = NULL,
        .func = &set_sta_static,
        .argtable = &set_sta_static_arg
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/** Arguments used by 'set_mac' function */
static struct {
    struct arg_int *mac0;
    struct arg_int *mac1;
    struct arg_int *mac2;
    struct arg_int *mac3;
    struct arg_int *mac4;
    struct arg_int *mac5;
    struct arg_end *end;
} set_mac_arg;

esp_err_t set_mac(const char *key, const char *interface, int argc, char **argv) {
    esp_err_t err;
    nvs_handle_t nvs;

    int nerrors = arg_parse(argc, argv, (void **) &set_mac_arg);
    if (nerrors != 0) {
        arg_print_errors(stderr, set_mac_arg.end, argv[0]);
        return 1;
    }

