martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    return err;
}

static void register_set_ap_ip(void)
{
    set_ap_ip_arg.ap_ip_str = arg_str1(NULL, NULL, "<ip>", "IP");
    set_ap_ip_arg.end = arg_end(1);

    const esp_console_cmd_t cmd = {
        .command = "set_ap_ip",
        .help = "Set IP for the AP interface",
        .hint = NULL,
        .func = &set_ap_ip,
        .argtable = &set_ap_ip_arg
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/** Arguments used by 'set_ap_dns' function */
static struct {
    struct arg_str *dns_str;
    struct arg_end *end;
} set_ap_dns_arg;

/* 'set_ap_dns' command */
static int set_ap_dns(int argc, char **argv)
{
    esp_err_t err;

    int nerrors = arg_parse(argc, argv, (void **) &set_ap_dns_arg);
    if (nerrors != 0) {
        arg_print_errors(stderr, set_ap_dns_arg.end, argv[0]);
        return 1;
    }

    preprocess_string((char*)set_ap_dns_arg.dns_str->sval[0]);

    err = set_config_param_str("ap_dns", set_ap_dns_arg.dns_str->sval[0]);
    if (err == ESP_OK) {
        ESP_LOGI(TAG, "AP DNS server '%s' stored.", set_ap_dns_arg.dns_str->sval[0]);
        printf("AP DNS set to: %s\n", set_ap_dns_arg.dns_str->sval[0]);
        if (strlen(set_ap_dns_arg.dns_str->sval[0]) == 0) {
            printf("DNS will be learned from upstream (default behavior).\n");
        }
        printf("Restart to apply.\n");
    }

    // Update global
    free(ap_dns);
    ap_dns = strdup(set_ap_dns_arg.dns_str->sval[0]);

    return err;
}

static void register_set_ap_dns(void)
{
    set_ap_dns_arg.dns_str = arg_str1(NULL, NULL, "<dns>", "DNS server IP (empty string to clear)");
    set_ap_dns_arg.end = arg_end(1);

    const esp_console_cmd_t cmd = {
        .command = "set_ap_dns",
        .help = "Set DNS server for AP clients (empty to use upstream)",
        .hint = NULL,
        .func = &set_ap_dns,
        .argtable = &set_ap_dns_arg
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_hostname' command */
static struct {
    struct arg_str *name;
    struct arg_end *end;
} set_hostname_arg;

int set_hostname(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &set_hostname_arg);
    if (nerrors != 0) {
        arg_print_errors(stderr, set_hostname_arg.end, argv[0]);
        return 1;
    }

    const char *name = set_hostname_arg.name->sval[0];
    preprocess_string((char*)name);

    // Validate: max 32 chars, only alphanumeric and hyphens (RFC 952)
    size_t len = strlen(name);
    if (len > 32) {
        printf("Hostname too long (max 32 characters).\n");
        return 1;
    }
    for (size_t i = 0; i < len; i++) {
        char c = name[i];
        if (!((c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
              (c >= '0' && c <= '9') || c == '-')) {
            printf("Invalid character '%c'. Use only letters, digits, and hyphens.\n", c);
            return 1;
        }
    }

    esp_err_t err = set_config_param_str("hostname", name);
    if (err != ESP_OK) {
        printf("Error saving hostname: %s\n", esp_err_to_name(err));
        return err;
    }

    ESP_LOGI(TAG, "Hostname set to '%s'", name);
    if (len > 0) {
        printf("Hostname set to: %s\n", name);
    } else {
        printf("Hostname cleared (will use default 'espressif').\n");
    }
    printf("Restart to apply.\n");

    free(hostname);
    hostname = strdup(name);

    return err;
}

static void register_set_hostname(void)
{
    set_hostname_arg.name = arg_str1(NULL, NULL, "<name>", "DHCP hostname (empty to clear)");
    set_hostname_arg.end = arg_end(1);

    const esp_console_cmd_t cmd = {
        .command = "set_hostname",
        .help = "Set DHCP client hostname for upstream network (empty to use default)",
        .hint = NULL,
        .func = &set_hostname,
        .argtable = &set_hostname_arg
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* Format web UI bind mask as a string, e.g. "AP STA " (or "AP ETH " for ETH_UPLINK) */
static void fmt_web_bind(uint8_t bind, char *buf)
{
    buf[0] = '\0';
    if (bind & RC_BIND_AP)  strcat(buf, "AP ");
#if CONFIG_ETH_UPLINK
    if (bind & RC_BIND_STA) strcat(buf, "ETH ");
#else
    if (bind & RC_BIND_STA) strcat(buf, "STA ");
#endif
    if (bind & RC_BIND_VPN) strcat(buf, "VPN ");
    if (buf[0] == '\0') strcpy(buf, "(none)");
}

/* 'web_ui' command */
static int web_ui_cmd(int argc, char **argv)
{
    if (argc < 2) {
        /* Show current status */
        char* lock = NULL;
        get_config_param_str("web_disabled", &lock);
        bool enabled = (lock == NULL || strcmp(lock, "0") == 0);
        int port = 80;
        get_config_param_int("web_port", &port);
        char bind_str[20];
        fmt_web_bind(web_ui_get_bind(), bind_str);
        printf("Web interface: %s (port %d, bind: %s)\n", enabled ? "enabled" : "disabled", port, bind_str);
        printf("\nUsage:\n");
        printf("  web_ui enable                     - Enable web interface (after reboot)\n");
        printf("  web_ui disable                    - Disable web interface (after reboot)\n");
        printf("  web_ui port <port>                - Set web server port (after reboot)\n");
#if CONFIG_ETH_UPLINK
        printf("  web_ui bind <ap|eth|vpn|all>      - Set allowed interfaces (takes effect immediately)\n");
#else
        printf("  web_ui bind <ap|sta|vpn|all>      - Set allowed interfaces (takes effect immediately)\n");
#endif
        if (lock != NULL) free(lock);
        return 0;
    }

    const char *action = argv[1];
    esp_err_t err = ESP_OK;

    if (strcmp(action, "enable") == 0) {
        err = set_config_param_str("web_disabled", "0");
        if (err == ESP_OK) {
            ESP_LOGW(TAG, "Web interface enabled via CLI.");
            printf("Web interface will be enabled after reboot.\n");
        }
    } else if (strcmp(action, "disable") == 0) {
        err = set_config_param_str("web_disabled", "1");
        if (err == ESP_OK) {
            ESP_LOGW(TAG, "Web interface disabled via CLI.");
            printf("Web interface will be disabled after reboot.\n");
            printf("Use 'web_ui enable' to re-enable it.\n");
        }
    } else if (strcmp(action, "port") == 0) {
        if (argc < 3) {
            int port = 80;
            get_config_param_int("web_port", &port);
            printf("Current web server port: %d\n", port);
            printf("Usage: web_ui port <port>\n");
            return 0;
        }
        int port = atoi(argv[2]);
        if (port < 1 || port > 65535) {
            printf("Invalid port: %s (must be 1-65535)\n", argv[2]);
            return 1;
        }
        err = set_config_param_int("web_port", port);
        if (err == ESP_OK) {
            ESP_LOGI(TAG, "Web server port set to %d.", port);
            printf("Web server port set to %d (after reboot).\n", port);
        }
    } else if (strcmp(action, "bind") == 0) {
        if (argc < 3) {
            char bind_str[20];
            fmt_web_bind(web_ui_get_bind(), bind_str);
            printf("Current web UI bind: %s\n", bind_str);
#if CONFIG_ETH_UPLINK
            printf("Usage: web_ui bind <ap|eth|vpn|all>\n");
            printf("  Interfaces may be comma-separated: web_ui bind ap,eth\n");
#else
            printf("Usage: web_ui bind <ap|sta|vpn|all>\n");
            printf("  Interfaces may be comma-separated: web_ui bind ap,sta\n");
#endif
            return 0;
        }
        /* Parse comma-separated interface list or "all" */
        uint8_t bind = 0;
        char arg[64];
        strlcpy(arg, argv[2], sizeof(arg));
        if (strcmp(arg, "all") == 0) {
            bind = RC_BIND_AP | RC_BIND_STA | RC_BIND_VPN;
        } else {
            char *tok = strtok(arg, ",");
            while (tok) {
                if      (strcmp(tok, "ap") == 0 || strcmp(tok, "AP") == 0)   bind |= RC_BIND_AP;
#if CONFIG_ETH_UPLINK
                else if (strcmp(tok, "eth") == 0 || strcmp(tok, "ETH") == 0) bind |= RC_BIND_STA;
#else
                else if (strcmp(tok, "sta") == 0 || strcmp(tok, "STA") == 0) bind |= RC_BIND_STA;
#endif
                else if (strcmp(tok, "vpn") == 0 || strcmp(tok, "VPN") == 0) bind |= RC_BIND_VPN;
                else {
#if CONFIG_ETH_UPLINK
                    printf("Unknown interface '%s' (valid: ap, eth, vpn, all)\n", tok);
#else
                    printf("Unknown interface '%s' (valid: ap, sta, vpn, all)\n", tok);
#endif
                    return 1;
                }
                tok = strtok(NULL, ",");
            }
        }
        if (bind == 0) {
            printf("At least one interface required, defaulting to ap.\n");
            bind = RC_BIND_AP;
        }
        web_ui_set_bind(bind);
        char bind_str[20];
        fmt_web_bind(bind, bind_str);
        printf("Web UI access restricted to: %s(takes effect immediately)\n", bind_str);
    } else {
        printf("Unknown action: %s\n", action);
        printf("Usage: web_ui <enable|disable|port|bind>\n");
        return 1;
    }

