martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
#if SOC_TEMP_SENSOR_SUPPORTED
        // CPU temperature
        {
            temperature_sensor_handle_t tsens;
            temperature_sensor_config_t tsens_cfg = TEMPERATURE_SENSOR_CONFIG_DEFAULT(20, 100);
            //temperature_sensor_config_t tsens_cfg = TEMPERATURE_SENSOR_CONFIG_DEFAULT(-10, 80);
            if (temperature_sensor_install(&tsens_cfg, &tsens) == ESP_OK) {
                float celsius = 0.0f;
                temperature_sensor_enable(tsens);
                if (temperature_sensor_get_celsius(tsens, &celsius) == ESP_OK) {
                    printf("CPU temperature: %.1f °C\n", celsius);
                }
                temperature_sensor_disable(tsens);
                temperature_sensor_uninstall(tsens);
            }
        }
#endif
        // Free heap
        printf("Free heap: %lu bytes\n", (unsigned long)esp_get_free_heap_size());

        if (connect_count > 0) {
            connected_client_t clients[8];
            int count = get_connected_clients(clients, 8);

            if (count > 0) {
                // Fetch per-client traffic stats only when enabled
                client_stats_entry_t stats[CLIENT_STATS_MAX];
                int stats_count = client_stats_enabled ? client_stats_get_all(stats, CLIENT_STATS_MAX) : 0;

                printf("\nClient Details:\n");
                if (client_stats_enabled) {
                    printf("MAC Address       IP Address       Device Name          TX / RX\n");
                    printf("----------------  ---------------  -------------------  ------------------\n");
                } else {
                    printf("MAC Address       IP Address       Device Name\n");
                    printf("----------------  ---------------  -------------------\n");
                }

                for (int i = 0; i < count; i++) {
                    char mac_str[18];
                    sprintf(mac_str, "%02X:%02X:%02X:%02X:%02X:%02X",
                            clients[i].mac[0], clients[i].mac[1], clients[i].mac[2],
                            clients[i].mac[3], clients[i].mac[4], clients[i].mac[5]);

                    char ip_str[16] = "N/A";
                    if (clients[i].has_ip) {
                        ip4_addr_t addr;
                        addr.addr = clients[i].ip;
                        sprintf(ip_str, IPSTR, IP2STR(&addr));
                    }

                    if (client_stats_enabled) {
                        char traffic_str[32] = "-";
                        for (int j = 0; j < stats_count; j++) {
                            if (memcmp(stats[j].mac, clients[i].mac, 6) == 0) {
                                char tx_buf[12], rx_buf[12];
                                format_bytes_human(stats[j].bytes_sent, tx_buf, sizeof(tx_buf));
                                format_bytes_human(stats[j].bytes_received, rx_buf, sizeof(rx_buf));
                                snprintf(traffic_str, sizeof(traffic_str), "%s / %s", tx_buf, rx_buf);
                                break;
                            }
                        }
                        printf("%-17s  %-15s  %-19s  %s\n", mac_str, ip_str, clients[i].name, traffic_str);
                    } else {
                        printf("%-17s  %-15s  %s\n", mac_str, ip_str, clients[i].name);
                    }
                }
            }
        }
        
    } else if (strcmp(type, "config") == 0) {
        // Show config
        char* static_ip = NULL;
        char* subnet_mask = NULL;
        char* gateway_addr = NULL;
        char* ap_ssid = NULL;
        char* ap_passwd = NULL;

        get_config_param_str("static_ip", &static_ip);
        get_config_param_str("subnet_mask", &subnet_mask);
        get_config_param_str("gateway_addr", &gateway_addr);
        get_config_param_str("ap_ssid", &ap_ssid);
        get_config_param_str("ap_passwd", &ap_passwd);

        printf("Router Configuration:\n");
        printf("====================\n");

        bool hide_pw = remote_console_is_capturing();
#if CONFIG_ETH_UPLINK
        printf("Uplink: Ethernet (LAN8720)\n");
#else
        char* ssid = NULL;
        char* ent_username = NULL;
        char* ent_identity = NULL;
        char* passwd = NULL;
        get_config_param_str("ssid", &ssid);
        get_config_param_str("ent_username", &ent_username);
        get_config_param_str("ent_identity", &ent_identity);
        get_config_param_str("passwd", &passwd);

        printf("STA Settings:\n");
        printf("  SSID: %s\n", ssid != NULL ? ssid : "<undef>");
        printf("  Password: %s\n", passwd == NULL ? "<undef>" : hide_pw ? "***" : passwd);
        if ((ent_username != NULL) && (strlen(ent_username) > 0)) {
            printf("  Enterprise Username: %s\n", ent_username);
            if ((ent_identity != NULL) && (strlen(ent_identity) > 0)) {
                printf("  Enterprise Identity: %s\n", ent_identity);
            }
            const char* eap_names[] = {"Auto", "PEAP", "TTLS", "TLS"};
            const char* phase2_names[] = {"MSCHAPv2", "MSCHAP", "PAP", "CHAP"};
            printf("  EAP Method: %s\n", (eap_method >= 0 && eap_method <= 3) ? eap_names[eap_method] : "Unknown");
            printf("  TTLS Phase 2: %s\n", (ttls_phase2 >= 0 && ttls_phase2 <= 3) ? phase2_names[ttls_phase2] : "Unknown");
            printf("  CA Cert Bundle: %s\n", use_cert_bundle ? "enabled" : "disabled");
            printf("  Time Check: %s\n", disable_time_check ? "disabled" : "enabled");
        } else {
            printf("  Enterprise: <not active>\n");
        }


#if WIFI_HAS_5GHZ
        {
            const char *band_names[] = {"auto", "2.4 GHz", "5 GHz"};
            printf("  Band preference: %s\n", band_names[sta_band <= STA_BAND_5G ? sta_band : 0]);
        }
#endif

        if (ssid != NULL) free(ssid);
        if (ent_username != NULL) free(ent_username);
        if (ent_identity != NULL) free(ent_identity);
        if (passwd != NULL) free(passwd);
#endif

        if (static_ip != NULL && strlen(static_ip) > 0) {
            printf("  Static IP: %s\n", static_ip);
            printf("  Subnet Mask: %s\n", subnet_mask != NULL ? subnet_mask : "<undef>");
            printf("  Gateway: %s\n", gateway_addr != NULL ? gateway_addr : "<undef>");
        } else {
            printf("  Static IP: <not configured>\n");
        }
        printf("  Hostname: %s\n", hostname);

        printf("\nAP Settings:\n");
        printf("  SSID: %s\n", ap_ssid != NULL ? ap_ssid : "<undef>");
        printf("  Password: %s\n", ap_passwd == NULL ? "<undef>" : hide_pw ? "***" : ap_passwd);
        ip4_addr_t addr;
        addr.addr = my_ap_ip;
        printf("  IP Address: " IPSTR "\n", IP2STR(&addr));
        printf("  DNS Server: %s\n", (ap_dns && ap_dns[0]) ? ap_dns : "(upstream)");
        {
            const char *auth_modes[] = {"WPA2/WPA3", "WPA2", "WPA3"};
            printf("  Security: %s\n", auth_modes[ap_authmode <= 2 ? ap_authmode : 0]);
        }
#if CONFIG_ETH_UPLINK
        printf("  Channel: %s", ap_channel > 0 ? "" : "auto\n");
        if (ap_channel > 0) printf("%d\n", ap_channel);
#endif

