martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    int action; // 0 = add, 1 = del, 2 = block
    if (strcmp((char *)dhcp_reserve_args.add_del->sval[0], "add") == 0) {
        action = 0;
    } else if (strcmp((char *)dhcp_reserve_args.add_del->sval[0], "del") == 0) {
        action = 1;
    } else if (strcmp((char *)dhcp_reserve_args.add_del->sval[0], "block") == 0) {
        action = 2;
    } else {
        printf("Must be 'add', 'del', or 'block'\n");
        return 1;
    }

    // Parse MAC address (AA:BB:CC:DD:EE:FF or AA-BB-CC-DD-EE-FF)
    unsigned int mac[6];
    const char *mac_str = dhcp_reserve_args.mac_addr->sval[0];
    if (sscanf(mac_str, "%02x:%02x:%02x:%02x:%02x:%02x",
               &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]) != 6 &&
        sscanf(mac_str, "%02x-%02x-%02x-%02x-%02x-%02x",
               &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]) != 6) {
        printf("Invalid MAC address format. Use AA:BB:CC:DD:EE:FF\n");
        return 1;
    }

    uint8_t mac_bytes[6];
    for (int i = 0; i < 6; i++) {
        mac_bytes[i] = (uint8_t)mac[i];
    }

    if (action == 2) {
        // Block: add reservation with IP 0.0.0.0
        const char *name = NULL;
        if (dhcp_reserve_args.name->count > 0) {
            name = dhcp_reserve_args.name->sval[0];
        }

        esp_err_t err = add_dhcp_reservation(mac_bytes, 0, name);
        if (err == ESP_OK) {
            printf("Client blocked\n");
        } else if (err == ESP_ERR_NO_MEM) {
            printf("No more slots available\n");
            return 1;
        } else {
            printf("Failed to block client\n");
            return 1;
        }
    } else if (action == 0) {
        // Parse IP address
        uint32_t ip = esp_ip4addr_aton((char *)dhcp_reserve_args.ip_addr->sval[0]);
        if (ip == IPADDR_NONE) {
            printf("Invalid IP address\n");
            return 1;
        }

        // Validate IP is in same /24 network as AP interface
        if (ip != 0 && (ip & 0x00FFFFFF) != (my_ap_ip & 0x00FFFFFF)) {
            ip4_addr_t ap_addr, res_addr;
            ap_addr.addr = my_ap_ip;
            res_addr.addr = ip;
            printf("IP " IPSTR " must be in same network as AP (" IPSTR "/24)\n",
                   IP2STR(&res_addr), IP2STR(&ap_addr));
            return 1;
        }

        // Get optional name
        const char *name = NULL;
        if (dhcp_reserve_args.name->count > 0) {
            name = dhcp_reserve_args.name->sval[0];
        }

        esp_err_t err = add_dhcp_reservation(mac_bytes, ip, name);
        if (err == ESP_OK) {
            printf(ip == 0 ? "Client blocked\n" : "DHCP reservation added\n");
        } else if (err == ESP_ERR_NO_MEM) {
            printf("No more slots available for DHCP reservations\n");
            return 1;
        } else {
            printf("Failed to add DHCP reservation\n");
            return 1;
        }
    } else {
        esp_err_t err = del_dhcp_reservation(mac_bytes);
        if (err == ESP_OK) {
            printf("DHCP reservation deleted\n");
        } else {
            printf("Failed to delete DHCP reservation\n");
            return 1;
        }
    }

    return ESP_OK;
}

static void register_dhcp_reserve(void)
{
    dhcp_reserve_args.add_del = arg_str1(NULL, NULL, "[add|del|block]", "add, delete, or block");
    dhcp_reserve_args.mac_addr = arg_str1(NULL, NULL, "<mac>", "MAC address (AA:BB:CC:DD:EE:FF)");
    dhcp_reserve_args.ip_addr = arg_str0(NULL, NULL, "<ip>", "IP address (required for add)");
    dhcp_reserve_args.name = arg_str0("-n", "--name", "<name>", "optional device name");
    dhcp_reserve_args.end = arg_end(4);

    const esp_console_cmd_t cmd = {
        .command = "dhcp_reserve",
        .help = "Add/delete DHCP reservation or block a client by MAC",
        .hint = NULL,
        .func = &dhcp_reserve,
        .argtable = &dhcp_reserve_args
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'bytes' command */
static struct {
    struct arg_str* action;
    struct arg_end* end;
} bytes_args;

static int bytes(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &bytes_args);
    if (nerrors != 0) {
        arg_print_errors(stderr, bytes_args.end, argv[0]);
        return 1;
    }

    if (bytes_args.action->count == 0) {
        // Show current byte counts
        printf("STA Interface Byte Counts:\n");
        printf("  Sent:     %" PRIu64 " bytes\n", get_sta_bytes_sent());
        printf("  Received: %" PRIu64 " bytes\n", get_sta_bytes_received());
        return 0;
    }

    const char *action = bytes_args.action->sval[0];
    if (strcmp(action, "reset") == 0) {
        reset_sta_byte_counts();
        printf("Byte counts reset to zero\n");
    } else {
        printf("Usage: bytes [reset]\n");
        printf("  bytes     - Show current byte counts\n");
        printf("  bytes reset - Reset byte counts to zero\n");
        return 1;
    }

    return 0;
}

static void register_bytes(void)
{
    bytes_args.action = arg_str0(NULL, NULL, "[reset]", "reset byte counts or show current counts");
    bytes_args.end = arg_end(1);

    const esp_console_cmd_t cmd = {
        .command = "bytes",
        .help = "Show or reset STA interface byte counts",
        .hint = NULL,
        .func = &bytes,
        .argtable = &bytes_args
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'pcap' command arguments */
static struct {
    struct arg_str* action;
    struct arg_str* mode;
    struct arg_int* snaplen;
    struct arg_end* end;
} pcap_args;

/* 'pcap' command implementation */
static int pcap(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &pcap_args);
    if (nerrors != 0) {
        arg_print_errors(stderr, pcap_args.end, argv[0]);
        return 1;
    }

    if (pcap_args.action->count == 0) {
        printf("Usage: pcap <action> [args]\n");
        printf("  mode [off|acl|promisc] - Get or set capture mode\n");
        printf("    off      - Capture disabled\n");
        printf("    acl      - Capture ACL_MONITOR flagged packets (any interface)\n");
        printf("    promisc  - Capture all AP client traffic (not STA)\n");
        printf("  status     - Show capture status\n");
        printf("  snaplen [n]- Get or set max capture bytes (64-1600)\n");
        printf("  start      - Legacy: enable promiscuous mode\n");
        printf("  stop       - Legacy: disable capture\n");
        return 1;
    }

    const char *action = pcap_args.action->sval[0];

    if (strcmp(action, "mode") == 0) {
        if (pcap_args.mode->count > 0) {
            const char *mode_str = pcap_args.mode->sval[0];
            if (strcmp(mode_str, "off") == 0) {
                pcap_set_mode(PCAP_MODE_OFF);
                printf("Capture mode: off\n");
            } else if (strcmp(mode_str, "acl") == 0) {
                pcap_set_mode(PCAP_MODE_ACL_MONITOR);
                printf("Capture mode: acl-monitor\n");
                printf("Only packets matching ACL rules with +M flag will be captured (any interface)\n");
            } else if (strcmp(mode_str, "promisc") == 0 || strcmp(mode_str, "promiscuous") == 0) {
                pcap_set_mode(PCAP_MODE_PROMISCUOUS);
                printf("Capture mode: promiscuous\n");
                printf("All AP client traffic will be captured (STA excluded)\n");
            } else {
                printf("Invalid mode. Use: off, acl, or promisc\n");
                return 1;
            }
            printf("Connect Wireshark to TCP port 19000\n");
        } else {
            printf("Current mode: %s\n", pcap_mode_to_string(pcap_get_mode()));
        }
    } else if (strcmp(action, "start") == 0) {
        // Legacy: start = promiscuous mode
        pcap_set_mode(PCAP_MODE_PROMISCUOUS);
        printf("PCAP capture started in promiscuous mode (snaplen=%d)\n", pcap_get_snaplen());
        printf("Connect Wireshark to TCP port 19000\n");
    } else if (strcmp(action, "stop") == 0) {
        // Legacy: stop = off mode
        pcap_set_mode(PCAP_MODE_OFF);
        printf("PCAP capture stopped\n");
    } else if (strcmp(action, "snaplen") == 0) {
        int val = 0;
        bool has_value = false;

