martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
        if (pcap_args.snaplen->count > 0) {
            val = pcap_args.snaplen->ival[0];
            has_value = true;
        } else if (pcap_args.mode->count > 0) {
            // argtable may have put the number in mode slot (string before int)
            val = atoi(pcap_args.mode->sval[0]);
            if (val > 0) has_value = true;
        }

        if (has_value) {
            if (pcap_set_snaplen((uint16_t)val)) {
                printf("Snaplen set to %d bytes\n", pcap_get_snaplen());
            } else {
                printf("Error: snaplen must be between 64 and 1600\n");
                return 1;
            }
        } else {
            printf("Current snaplen: %d bytes\n", pcap_get_snaplen());
        }
    } else if (strcmp(action, "status") == 0) {
        printf("PCAP Capture Status:\n");
        printf("====================\n");
        printf("Mode:     %s\n", pcap_mode_to_string(pcap_get_mode()));
        printf("Client:   %s\n", pcap_client_connected() ? "connected" : "not connected");
        printf("Snaplen:  %d bytes\n", pcap_get_snaplen());

        size_t used, total;
        pcap_get_buffer_usage(&used, &total);
        printf("Buffer:   %u / %u bytes (%.1f%%)\n",
               (unsigned)used, (unsigned)total,
               total > 0 ? (100.0f * used / total) : 0.0f);

        printf("Captured: %lu packets\n", (unsigned long)pcap_get_captured_count());
        printf("Dropped:  %lu packets\n", (unsigned long)pcap_get_dropped_count());
        printf("\nConnection: nc <esp32_ip> 19000 | wireshark -k -i -\n");
    } else {
        printf("Invalid action. Use: pcap <mode|status|snaplen|start|stop>\n");
        return 1;
    }

    return 0;
}

static void register_pcap(void)
{
    pcap_args.action = arg_str1(NULL, NULL, "<action>", "mode|status|snaplen|start|stop");
    pcap_args.mode = arg_str0(NULL, NULL, "<mode>", "off|acl|promisc");
    pcap_args.snaplen = arg_int0(NULL, NULL, "<bytes>", "snaplen value (64-1600)");
    pcap_args.end = arg_end(3);

    const esp_console_cmd_t cmd = {
        .command = "pcap",
        .help = "Control PCAP packet capture (TCP port 19000)",
        .hint = NULL,
        .func = &pcap,
        .argtable = &pcap_args
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_led_gpio' command */
static int set_led_gpio_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: set_led_gpio <gpio_number|none>\n");
        printf("  gpio_number: GPIO pin number (0-48)\n");
        printf("  none: disable LED status blinking\n");
        printf("\nCurrent setting: ");
        if (led_gpio < 0) {
            printf("none (disabled)\n");
        } else {
            printf("GPIO %d\n", led_gpio);
        }
        return 0;
    }

    esp_err_t err;
    int gpio_num;

    // Parse argument
    if (strcasecmp(argv[1], "none") == 0 || strcmp(argv[1], "-1") == 0) {
        gpio_num = -1;
    } else {
        char *endptr;
        gpio_num = strtol(argv[1], &endptr, 10);
        if (*endptr != '\0' || gpio_num < 0 || gpio_num > 48) {
            printf("Invalid GPIO number. Use 0-48 or 'none'.\n");
            return 1;
        }
    }

    err = set_config_param_int("led_gpio", gpio_num);
    if (err == ESP_OK) {
        if (gpio_num < 0) {
            ESP_LOGI(TAG, "LED GPIO disabled.");
            printf("LED status blinking disabled.\n");
        } else {
            ESP_LOGI(TAG, "LED GPIO set to %d.", gpio_num);
            printf("LED status blinking set to GPIO %d.\n", gpio_num);
        }
        printf("Restart the device for changes to take effect.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_led_gpio(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_led_gpio",
        .help = "Set GPIO for status LED blinking (use 'none' to disable)",
        .hint = NULL,
        .func = &set_led_gpio_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_led_lowactive' command - set LED low-active (inverted) mode */
static int set_led_lowactive_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: set_led_lowactive <true|false>\n");
        printf("  true: LED is active-low (inverted, common for onboard LEDs)\n");
        printf("  false: LED is active-high (default)\n");
        printf("\nCurrent setting: %s\n", led_lowactive ? "true (low-active)" : "false (active-high)");
        return 0;
    }

    esp_err_t err;
    int value;

    // Parse boolean argument
    if (parse_bool_true(argv[1])) {
        value = 1;
    } else if (parse_bool_false(argv[1])) {
        value = 0;
    } else {
        printf("Invalid value. Use true/false.\n");
        return 1;
    }

    err = set_config_param_int("led_low", value);
    if (err == ESP_OK) {
        led_lowactive = value;
        if (value) {
            ESP_LOGI(TAG, "LED set to low-active (inverted) mode.");
            printf("LED set to low-active (inverted) mode.\n");
        } else {
            ESP_LOGI(TAG, "LED set to active-high (normal) mode.");
            printf("LED set to active-high (normal) mode.\n");
        }
        printf("Change takes effect immediately.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_led_lowactive(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_led_lowactive",
        .help = "Set LED to low-active (inverted) mode for active-low LEDs",
        .hint = NULL,
        .func = &set_led_lowactive_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_led_strip' command - set GPIO for addressable LED strip (WS2812) */
static int set_led_strip_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: set_led_strip <gpio_number|none>\n");
        printf("  gpio_number: GPIO pin for WS2812 data line (0-48)\n");
        printf("  none: disable addressable LED strip\n");
        printf("\nCurrent setting: ");
        if (led_strip_gpio < 0) {
            printf("none (disabled)\n");
        } else {
            printf("GPIO %d\n", led_strip_gpio);
        }
        return 0;
    }

