martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    int mode_val = -1;
    if (strcasecmp(argv[1], "wpa2wpa3") == 0 || strcasecmp(argv[1], "wpa2/wpa3") == 0) {
        mode_val = 0;
    } else if (strcasecmp(argv[1], "wpa2") == 0) {
        mode_val = 1;
    } else if (strcasecmp(argv[1], "wpa3") == 0) {
        mode_val = 2;
    } else {
        printf("Invalid mode. Use: wpa2, wpa3, or wpa2wpa3\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("ap_authmode", mode_val);
    if (err == ESP_OK) {
        ap_authmode = (uint8_t)mode_val;
        printf("AP auth mode set to: %s\n", modes[mode_val]);
        printf("Restart the device for changes to take effect.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_ap_auth(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_ap_auth",
        .help = "Set AP auth mode (wpa2, wpa3, or wpa2wpa3; requires restart)",
        .hint = NULL,
        .func = &set_ap_auth_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

#if CONFIG_ETH_UPLINK
/* 'set_ap_channel' command - set AP WiFi channel (ETH_UPLINK only) */
static int set_ap_channel_cmd(int argc, char **argv)
{
    if (argc < 2) {
        if (ap_channel == 0) {
            printf("AP channel: auto\n");
        } else {
            printf("AP channel: %d\n", ap_channel);
        }
        return 0;
    }

    int channel_val = atoi(argv[1]);
    if (channel_val < 0 || channel_val > 13) {
        printf("Invalid channel. Use 0 (auto) or 1-13.\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("ap_channel", channel_val);
    if (err == ESP_OK) {
        ap_channel = (uint8_t)channel_val;
        if (channel_val == 0) {
            printf("AP channel set to: auto\n");
        } else {
            printf("AP channel set to: %d\n", channel_val);
        }
        printf("Restart the device for changes to take effect.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_ap_channel(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_ap_channel",
        .help = "Set AP WiFi channel (0=auto, 1-13=fixed, requires restart)",
        .hint = NULL,
        .func = &set_ap_channel_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
#endif

/* 'ap' command - enable/disable AP interface dynamically */
static int ap_cmd(int argc, char **argv)
{
    if (argc < 2) {
        wifi_mode_t mode = WIFI_MODE_NULL;
        esp_wifi_get_mode(&mode);
#if CONFIG_ETH_UPLINK
        bool running = (mode == WIFI_MODE_AP);
#else
        bool running = (mode == WIFI_MODE_APSTA || mode == WIFI_MODE_AP);
#endif
        printf("AP interface: %s\n", running ? "enabled" : "disabled");
        printf("  (NVS setting: %s)\n", ap_disabled ? "disabled" : "enabled");
        printf("\nUsage:\n");
        printf("  ap enable   - Enable AP interface immediately\n");
        printf("  ap disable  - Disable AP interface immediately\n");
        return 0;
    }

    const char *action = argv[1];
    if (strcmp(action, "enable") == 0) {
        if (!ap_disabled) {
            printf("AP interface is already enabled.\n");
            return 0;
        }
        ap_set_enabled(true);
        printf("AP interface enabled.\n");
    } else if (strcmp(action, "disable") == 0) {
        if (ap_disabled) {
            printf("AP interface is already disabled.\n");
            return 0;
        }
        ap_set_enabled(false);
        printf("AP interface disabled.\n");
    } else {
        printf("Unknown action: %s\n", action);
        printf("Usage: ap <enable|disable>\n");
        return 1;
    }
    return 0;
}

static void register_ap(void)
{
    const esp_console_cmd_t cmd = {
        .command = "ap",
        .help = "Enable or disable the AP interface\n"
                "  ap          - Show current AP status\n"
                "  ap enable   - Enable AP interface\n"
                "  ap disable  - Disable AP interface",
        .hint = " <enable|disable>",
        .func = &ap_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

#if WIFI_HAS_5GHZ
/* 'set_sta_band' command - set STA band preference (5 GHz capable targets) */
static int set_sta_band_cmd(int argc, char **argv)
{
    if (argc < 2) {
        const char *names[] = {"auto", "2.4 GHz", "5 GHz"};
        printf("STA band preference: %s\n", names[sta_band <= STA_BAND_5G ? sta_band : 0]);
        return 0;
    }

    int band_val;
    if (strcmp(argv[1], "auto") == 0 || strcmp(argv[1], "0") == 0) {
        band_val = STA_BAND_AUTO;
    } else if (strcmp(argv[1], "2.4") == 0 || strcmp(argv[1], "1") == 0) {
        band_val = STA_BAND_2G;
    } else if (strcmp(argv[1], "5") == 0 || strcmp(argv[1], "2") == 0) {
        band_val = STA_BAND_5G;
    } else {
        printf("Invalid band. Use: auto, 2.4, or 5\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("sta_band", band_val);
    if (err == ESP_OK) {
        sta_band = (uint8_t)band_val;
        const char *names[] = {"auto", "2.4 GHz", "5 GHz"};
        printf("STA band preference set to: %s\n", names[band_val]);
        printf("Restart the device for changes to take effect.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_sta_band(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_sta_band",
        .help = "Set STA band preference (auto, 2.4, 5; requires restart)",
        .hint = NULL,
        .func = &set_sta_band_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
#endif /* WIFI_HAS_5GHZ */

/**
 * @brief Format IP address with device name for /32 addresses
 * If the IP has a full /32 mask and a matching DHCP reservation with a name,
 * returns the device name. Otherwise returns the formatted IP/mask.
 */
static char* acl_format_ip_with_name(uint32_t ip, uint32_t mask, char* buf, size_t buf_len)
{
    /* Check for "any" (0.0.0.0/0) */
    if (ip == 0 && mask == 0) {
        snprintf(buf, buf_len, "any");
        return buf;
    }

