martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    /* For /32 addresses, try to look up device name */
    if (mask == 0xFFFFFFFF) {
        const char* name = lookup_device_name_by_ip(ip);
        if (name != NULL) {
            snprintf(buf, buf_len, "%s", name);
            return buf;
        }
    }

    /* Fall back to standard IP formatting */
    return acl_format_ip(ip, mask, buf, buf_len);
}

/**
 * @brief Parse IP address or device name for ACL rules
 * First tries to parse as IP/CIDR, then tries to resolve as device name.
 * Device names are resolved to /32 addresses.
 */
static bool acl_parse_ip_or_name(const char* str, uint32_t* ip, uint32_t* mask)
{
    /* First try standard IP parsing */
    if (acl_parse_ip(str, ip, mask)) {
        return true;
    }

    /* Try to resolve as device name (case-insensitive) */
    if (resolve_device_name_to_ip(str, ip)) {
        *mask = 0xFFFFFFFF;  /* /32 for device names */
        return true;
    }

    return false;
}

/**
 * @brief Print ACL rules with device names for /32 addresses
 */
static void acl_print_with_names(uint8_t acl_no)
{
    if (acl_no >= MAX_ACL_LISTS) {
        printf("Invalid ACL list number\n");
        return;
    }

    printf("\nACL: %s\n", acl_get_name(acl_no));
    printf("==========\n");

    acl_stats_t *stats = acl_get_stats(acl_no);
    printf("Stats: allowed=%lu, denied=%lu, no_match=%lu\n",
           (unsigned long)stats->packets_allowed,
           (unsigned long)stats->packets_denied,
           (unsigned long)stats->packets_nomatch);

    if (acl_is_empty(acl_no)) {
        printf("No rules configured (all packets allowed)\n");
        return;
    }

    printf("\n%3s  %-6s  %-20s  %-20s  %-6s  %-6s  %-8s  %s\n",
           "Idx", "Proto", "Source", "Destination", "SPort", "DPort", "Action", "Hits");
    printf("---  ------  --------------------  --------------------  ------  ------  --------  ----\n");

    /* Snapshot rules under the lock, then print outside to avoid
     * blocking packet processing (printf can block via remote console). */
    acl_entry_t rules_copy[MAX_ACL_ENTRIES];
    acl_lock();
    acl_entry_t *rules = acl_get_rules(acl_no);
    memcpy(rules_copy, rules, sizeof(rules_copy));
    acl_unlock();

    for (int i = 0; i < MAX_ACL_ENTRIES; i++) {
        acl_entry_t *rule = &rules_copy[i];
        if (!rule->valid) {
            continue;
        }

        /* Format protocol */
        const char *proto_str;
        switch (rule->proto) {
            case 0:  proto_str = "IP"; break;
            case 1:  proto_str = "ICMP"; break;
            case 6:  proto_str = "TCP"; break;
            case 17: proto_str = "UDP"; break;
            default: proto_str = "?"; break;
        }

        /* Format IP addresses with device names */
        char src_str[24], dest_str[24];
        acl_format_ip_with_name(rule->src, rule->s_mask, src_str, sizeof(src_str));
        acl_format_ip_with_name(rule->dest, rule->d_mask, dest_str, sizeof(dest_str));

        /* Format ports */
        char s_port_str[8], d_port_str[8];
        if (rule->s_port == 0) {
            strcpy(s_port_str, "*");
        } else {
            snprintf(s_port_str, sizeof(s_port_str), "%d", rule->s_port);
        }
        if (rule->d_port == 0) {
            strcpy(d_port_str, "*");
        } else {
            snprintf(d_port_str, sizeof(d_port_str), "%d", rule->d_port);
        }

        /* Format action */
        const char *action_str;
        uint8_t action = rule->allow & 0x01;
        uint8_t monitor = rule->allow & ACL_MONITOR;
        if (action == ACL_ALLOW) {
            action_str = monitor ? "allow+M" : "allow";
        } else {
            action_str = monitor ? "deny+M" : "deny";
        }

        printf("%3d  %-6s  %-20s  %-20s  %-6s  %-6s  %-8s  %lu\n",
               i, proto_str, src_str, dest_str, s_port_str, d_port_str,
               action_str, (unsigned long)rule->hit_count);
    }
}

/* 'acl' command implementation */
static int acl_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: acl <list> <action> [params...]\n");
        printf("Lists: from_esp, to_esp, from_ap, to_ap\n");
        printf("\nActions:\n");
        printf("  acl <list> clear              - Clear all rules from list\n");
        printf("  acl <list> clear_stats        - Clear statistics for list\n");
        printf("  acl <list> del <idx>          - Delete rule at index\n");
        printf("  acl <list> <proto> <src> [<s_port>] <dst> [<d_port>] <action>\n");
        printf("\nProtocols: IP, TCP, UDP, ICMP\n");
        printf("Addresses: IP/mask, 'any', or device name from DHCP reservations\n");
        printf("Ports:     Port number or '*' for any (TCP/UDP only)\n");
        printf("Actions:   allow, deny, allow_monitor, deny_monitor\n");
        printf("\nExamples:\n");
        printf("  acl from_esp clear\n");
        printf("  acl from_esp IP any 255.255.255.255 allow\n");
        printf("  acl from_esp UDP any any any 53 allow\n");
        printf("  acl from_esp TCP any 22 192.168.4.0/24 * deny\n");
        printf("  acl from_esp IP any MyPhone deny      # Use device name\n");
        printf("  acl from_esp IP any any deny          # Block all at end\n");
        printf("  acl from_esp del 0                    # Delete first rule\n");
        return 0;
    }

    /* Parse list name */
    int list_no = acl_parse_name(argv[1]);
    if (list_no < 0) {
        printf("Invalid ACL list: %s\n", argv[1]);
        printf("Use: from_esp, to_esp, from_ap, to_ap\n");
        return 1;
    }

    if (argc < 3) {
        printf("Missing action. Use: clear, clear_stats, del, or <proto> <src> <dst> <action>\n");
        return 1;
    }

    /* Handle 'clear' action */
    if (strcmp(argv[2], "clear") == 0) {
        acl_clear(list_no);
        save_acl_rules();
        ESP_LOGW(TAG, "ACL list %s cleared via CLI.", acl_get_name(list_no));
        printf("ACL list %s cleared.\n", acl_get_name(list_no));
        return 0;
    }

    /* Handle 'clear_stats' action */
    if (strcmp(argv[2], "clear_stats") == 0) {
        acl_clear_stats(list_no);
        printf("ACL statistics for %s cleared.\n", acl_get_name(list_no));
        return 0;
    }

