martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    /* Stop connection attempts so they don't interfere with scanning */
    if (!ap_connect) {
        wifi_scan_active = true;
        esp_wifi_disconnect();
        vTaskDelay(pdMS_TO_TICKS(100));  /* Let disconnect complete */
    }

    printf("Scanning for WiFi networks...\n");
    esp_err_t err = esp_wifi_scan_start(&scan_config, true);  /* Blocking scan */

    /* Read results BEFORE clearing flag or reconnecting, so nothing
     * can interfere with the scan result buffer. */
    uint16_t ap_count = 0;
    wifi_ap_record_t *ap_list = NULL;

    if (err == ESP_OK) {
        esp_wifi_scan_get_ap_num(&ap_count);
        if (ap_count > 0) {
            ap_list = malloc(sizeof(wifi_ap_record_t) * ap_count);
            if (ap_list != NULL) {
                esp_wifi_scan_get_ap_records(&ap_count, ap_list);
            } else {
                ap_count = 0;
            }
        }
    }

    /* Now safe to resume connection attempts */
    wifi_scan_active = false;
    if (!ap_connect) {
        esp_wifi_connect();
    }

    if (err != ESP_OK) {
        printf("Scan failed: %s\n", esp_err_to_name(err));
        return 1;
    }

    if (ap_count == 0) {
        printf("No networks found.\n");
        return 0;
    }

    /* Print header */
    printf("\nFound %d networks:\n", ap_count);
#if WIFI_HAS_5GHZ
    printf("%-32s  %3s  %5s  %4s  %-12s\n", "SSID", "Ch", "Band", "RSSI", "Security");
    printf("--------------------------------  ---  -----  ----  ------------\n");

    for (int i = 0; i < ap_count; i++) {
        const char *auth = auth_mode_to_str(ap_list[i].authmode);
        printf("%-32s  %3d  %5s  %4d  %s\n", ap_list[i].ssid, ap_list[i].primary,
               ap_list[i].primary > 14 ? "5 GHz" : "2.4 G", ap_list[i].rssi, auth);
    }
#else
    printf("%-32s  %3s  %4s  %-12s\n", "SSID", "Ch", "RSSI", "Security");
    printf("--------------------------------  ---  ----  ------------\n");

    for (int i = 0; i < ap_count; i++) {
        const char *auth = auth_mode_to_str(ap_list[i].authmode);
        printf("%-32s  %3d  %4d  %s\n", ap_list[i].ssid, ap_list[i].primary, ap_list[i].rssi, auth);
    }
#endif

    free(ap_list);
    return 0;
}

static void register_scan(void)
{
    const esp_console_cmd_t cmd = {
        .command = "scan",
        .help = "Scan for available WiFi networks",
        .hint = NULL,
        .func = &scan_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
#endif /* !CONFIG_ETH_UPLINK */

/** Arguments used by 'set_vpn' function */
static struct {
    struct arg_str *privkey;
    struct arg_str *pubkey;
    struct arg_str *endpoint;
    struct arg_str *address;
    struct arg_str *psk;
    struct arg_str *mask;
    struct arg_str *dns;
    struct arg_int *port;
    struct arg_int *keepalive;
    struct arg_int *enable;
    struct arg_int *killswitch;
    struct arg_int *route_all;
    struct arg_end *end;
} set_vpn_args;

static int set_vpn_cmd(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &set_vpn_args);
    if (nerrors != 0) {
        arg_print_errors(stderr, set_vpn_args.end, argv[0]);
        return 1;
    }

    nvs_handle_t nvs;
    esp_err_t err = nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &nvs);
    if (err != ESP_OK) {
        printf("Error opening NVS: %s\n", esp_err_to_name(err));
        return 1;
    }

    if (set_vpn_args.privkey->count > 0) {
        nvs_set_str(nvs, "vpn_privkey", set_vpn_args.privkey->sval[0]);
    }
    if (set_vpn_args.pubkey->count > 0) {
        nvs_set_str(nvs, "vpn_pubkey", set_vpn_args.pubkey->sval[0]);
    }
    if (set_vpn_args.endpoint->count > 0) {
        nvs_set_str(nvs, "vpn_endpoint", set_vpn_args.endpoint->sval[0]);
    }
    if (set_vpn_args.address->count > 0) {
        nvs_set_str(nvs, "vpn_ip", set_vpn_args.address->sval[0]);
    }
    if (set_vpn_args.psk->count > 0) {
        nvs_set_str(nvs, "vpn_psk", set_vpn_args.psk->sval[0]);
    }
    if (set_vpn_args.mask->count > 0) {
        nvs_set_str(nvs, "vpn_mask", set_vpn_args.mask->sval[0]);
    }
    if (set_vpn_args.dns->count > 0) {
        nvs_set_str(nvs, "vpn_dns", set_vpn_args.dns->sval[0]);
    }
    if (set_vpn_args.port->count > 0) {
        nvs_set_i32(nvs, "vpn_port", set_vpn_args.port->ival[0]);
    }
    if (set_vpn_args.keepalive->count > 0) {
        nvs_set_i32(nvs, "vpn_ka", set_vpn_args.keepalive->ival[0]);
    }
    if (set_vpn_args.enable->count > 0) {
        nvs_set_i32(nvs, "vpn_enabled", set_vpn_args.enable->ival[0]);
    }
    if (set_vpn_args.killswitch->count > 0) {
        nvs_set_i32(nvs, "vpn_ks", set_vpn_args.killswitch->ival[0]);
    }
    if (set_vpn_args.route_all->count > 0) {
        nvs_set_i32(nvs, "vpn_rall", set_vpn_args.route_all->ival[0]);
    }

    nvs_commit(nvs);
    nvs_close(nvs);
    printf("VPN settings saved. Restart to apply.\n");
    return 0;
}

static void register_set_vpn(void)
{
    set_vpn_args.privkey   = arg_str0(NULL, NULL, "<private_key>", "WireGuard private key (base64)");
    set_vpn_args.pubkey    = arg_str0(NULL, NULL, "<public_key>", "Peer public key (base64)");
    set_vpn_args.endpoint  = arg_str0(NULL, NULL, "<endpoint>", "Peer endpoint host/IP");
    set_vpn_args.address   = arg_str0(NULL, NULL, "<address>", "Tunnel IP (e.g. 10.0.0.2)");
    set_vpn_args.psk       = arg_str0("k", "psk", "<preshared_key>", "Preshared key (base64)");
    set_vpn_args.mask      = arg_str0("m", "mask", "<netmask>", "Tunnel netmask (default 255.255.255.0)");
    set_vpn_args.dns       = arg_str0("d", "dns", "<dns_ip>", "DNS server for AP clients while VPN is up");
    set_vpn_args.port      = arg_int0("p", "port", "<port>", "Peer UDP port (default 51820)");
    set_vpn_args.keepalive = arg_int0("a", "keepalive", "<seconds>", "Persistent keepalive (0=disabled)");
    set_vpn_args.enable    = arg_int0("e", "enable", "<0|1>", "Enable/disable VPN");
    set_vpn_args.killswitch = arg_int0("K", "killswitch", "<0|1>", "Kill switch: block internet when VPN down (default on)");
    set_vpn_args.route_all = arg_int0("R", "route-all", "<0|1>", "Route all traffic through VPN (0=split tunnel)");
    set_vpn_args.end       = arg_end(4);

    const esp_console_cmd_t cmd = {
        .command = "set_vpn",
        .help = "Configure WireGuard VPN (restart to apply)",
        .hint = NULL,
        .func = &set_vpn_cmd,
        .argtable = &set_vpn_args
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
